# Analyzing CIA Factbook Data Using SQL

## Introduction

In this project, we'll work with data from the [CIA World Factbook](https://www.cia.gov/the-world-factbook/), a compendium of statistics about all of the countries on Earth. The Factbook contains demographic information like the following:

- `population` - the global population


- `population_growth` - the annual population growth rate, as a percentage


- `area` - the total land and water are


Data Source: [Database](https://dss-server-prod-resources-1.s3.amazonaws.com/257/factbook.db)

In [9]:
# !conda update -n base -c defaults conda

In [10]:
# !conda install -yc conda-forge ipython-sql

### Connect to database
# %%capture
%load_ext sql
%sql sqlite:///factbook.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @factbook.db'

## Overview of the Data

In [32]:
%%sql
SELECT * FROM sqlite_master
WHERE type='table'

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [31]:
%%sql
SELECT * FROM facts
LIMIT 5

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

- `name` - The name of the country
- `area` - The total land and sea area of the country
- `area_land` - The country's land area in square kilometers
- `area_water` - The country's waterarea in square kilometers
- `population` - The country's population
- `population_growth`- The country's population growth as a percentage
- `birth_rate` - The country's birth rate, or the number of births a year per 1,000 people
- `death_rate` - The country's death rate, or the number of death a year per 1,000 people


## Summary Statistics

Let's start by calculating some summary statistics and look for any outlier country.

In [30]:
%%sql
/* ### Query max and min population and population growth values */
SELECT MIN(population) AS min_pop,
MAX(population) AS max_pop,
MIN(population_growth) AS min_pop_growth,
MAX(population_growth) max_pop_growth 
FROM facts

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

We see a few interesting things in the summary statistics:

- There's a country with a population of `0`
- There's a country with a population of `7256490011` (or more than 7.2 billion people)

Let's check these countries.

## Exploring outliers

In [25]:
%%sql
/* ### Query countries with max and min population and population growth */
SELECT * FROM facts
WHERE population = (SELECT MIN(population) FROM facts) OR
population = (SELECT MAX(population) FROM facts) OR
population_growth = (SELECT MIN(population_growth) FROM facts) OR
population_growth = (SELECT MAX(population_growth) FROM facts)

 * sqlite:///factbook.db
Done.

[(162, 'od', 'South Sudan', 644329, None, None, 12042910, 4.02, 36.91, 8.18, 11.47),
 (190, 'vt', 'Holy See (Vatican City)', 0, 0, 0, 842, 0.0, None, None, None),
 (200, 'ck', 'Cocos (Keeling) Islands', 14, 14, 0, 596, 0.0, None, None, None),
 (207, 'gl', 'Greenland', 2166086, 2166086, None, 57733, 0.0, 14.48, 8.49, 5.98),
 (238, 'pc', 'Pitcairn Islands', 47, 47, 0, 48, 0.0, None, None, None),
 (250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None),
 (261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

It seems like the table contains a row for the whole world, which explains a population of over 7.2 billion. It also seems like the table contains a row for Antarctica, which explains the population of 0.

Now that we know this, we should recalculate the summary statistics excluding the row for the whole world.

In [39]:
%%sql
/* ### Query country with max population */
SELECT * FROM facts
WHERE population = (SELECT MAX(population) FROM facts
                   WHERE name <> 'World')

 * sqlite:///factbook.db
Done.

[(37, 'ch', 'China', 9596960, 9326410, 270550, 1367485388, 0.45, 12.49, 7.53, 0.44)]

As expected, China has the largest population.

## Exploring Average Population and Area

In [38]:
%%sql
/* ### Query average population and area */
SELECT ROUND(AVG(population)) AS avg_pop,
       ROUND(AVG(area)) AS avg_area
FROM facts
WHERE name <> 'World'

 * sqlite:///factbook.db
Done.

[(32242667.0, 555094.0)]

We see that the average population is around 32 million and the average area is 555 thousand square kilometers.

## Finding Densely Populated Countries

To finish, we'll find countries that are densely populated. We'll identify countries that have the following:

- Above-average values for population


- Below-average values for area

In [42]:
%%sql
SELECT * FROM facts
WHERE population > (SELECT AVG(population) FROM facts
                   WHERE name <> 'World') 
      AND area < (SELECT AVG(area) FROM facts
                 WHERE name <> 'World')

 * sqlite:///factbook.db
Done.

[(14, 'bg', 'Bangladesh', 148460, 130170, 18290, 168957745, 1.6, 21.14, 5.61, 0.46),
 (65, 'gm', 'Germany', 357022, 348672, 8350, 80854408, 0.17, 8.47, 11.42, 1.24),
 (80, 'iz', 'Iraq', 438317, 437367, 950, 37056169, 2.93, 31.45, 3.77, 1.62),
 (83, 'it', 'Italy', 301340, 294140, 7200, 61855120, 0.27, 8.74, 10.19, 4.1),
 (85, 'ja', 'Japan', 377915, 364485, 13430, 126919659, 0.16, 7.93, 9.51, 0.0),
 (91, 'ks', 'Korea, South', 99720, 96920, 2800, 49115196, 0.14, 8.19, 6.75, 0.0),
 (120, 'mo', 'Morocco', 446550, 446300, 250, 33322699, 1.0, 18.2, 4.81, 3.36),
 (138, 'rp', 'Philippines', 300000, 298170, 1830, 100998376, 1.61, 24.27, 6.11, 2.09),
 (139, 'pl', 'Poland', 312685, 304255, 8430, 38562189, 0.09, 9.74, 10.19, 0.46),
 (163, 'sp', 'Spain', 505370, 498980, 6390, 48146134, 0.89, 9.64, 9.04, 8.31),
 (173, 'th', 'Thailand', 513120, 510890, 2230, 67976405, 0.34, 11.19, 7.8, 0.0),
 (182, 'ug', 'Uganda', 241038, 197100, 43938, 37101745, 3.24, 43.79, 10.69, 0.74),
 (185, 'uk', 'United Kingdom', 243610, 241930, 1680, 64088222, 0.54, 12.17, 9.35, 2.54),
 (192, 'vm', 'Vietnam', 331210, 310070, 21140, 94348835, 0.97, 15.96, 5.93, 0.3)]

These countries are generally known to be densely populated.

## Water to Land Ratio

In [48]:
%%sql
SELECT name, ROUND(1.0*area_water/1.0/area_land, 2) AS ratio
FROM facts
ORDER BY ratio DESC
LIMIT 5

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 905.67),
 ('Virgin Islands', 4.52),
 ('Puerto Rico', 0.55),
 ('Bahamas, The', 0.39),
 ('Guinea-Bissau', 0.28)]

Looks like the island states have greater water to land ratio. And only two country in the world have water area greater that land area - Virgin Islands and British Indian Ocean Territory.

## Population Growth

Let's see which countries will add the most and the least people to their populations next year. We'll subtract death rate from birth rate.

In [59]:
%%sql
SELECT name, ROUND((birth_rate - death_rate), 1) AS growth_rate
FROM facts
WHERE name <> 'World' and growth_rate IS NOT NULL
ORDER BY growth_rate
LIMIT 10

 * sqlite:///factbook.db
Done.

[('Bulgaria', -5.5),
 ('Serbia', -4.6),
 ('Latvia', -4.3),
 ('Lithuania', -4.2),
 ('Ukraine', -3.7),
 ('Hungary', -3.6),
 ('Germany', -3.0),
 ('Slovenia', -3.0),
 ('Romania', -2.8),
 ('Belarus', -2.7)]

Looks like the East European countries slightly loose their population.

In [60]:
%%sql
SELECT name, ROUND((birth_rate - death_rate), 1) AS growth_rate
FROM facts
WHERE name <> 'World' and growth_rate IS NOT NULL
ORDER BY growth_rate DESC
LIMIT 10

 * sqlite:///factbook.db
Done.

[('Malawi', 33.2),
 ('Uganda', 33.1),
 ('Niger', 33.0),
 ('Burundi', 32.7),
 ('Mali', 32.1),
 ('Burkina Faso', 30.3),
 ('Zambia', 29.5),
 ('Ethiopia', 29.1),
 ('South Sudan', 28.7),
 ('Tanzania', 28.4)]

And obviously, the African countries increase their population the most. 

## Conclusions

We've observed some statistics about countries using SQL queries in Jupyter Notebook, and realized that the East European countries population slowly decreases.